Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: རྟག་ཏུ་རྒྱ་མཚོའི་འགྲམ་དང་ནི། །སྙིང་པོ་མེད་པའི་འབབ་ཆུ་མཆོག །གང་གཱའི་འགྲམ་ནི་ཐམས་ཅད་དུ། །པདྨ་འབྱུང་བ་བསྒྲུབ་པར་བྱ། །
en: “As always, the [mantras of] the Lotus family Will be effective in places such as the ocean’s shore, Near the supreme thundering river, And everywhere along the banks of the Gaṅgā. {53.813}

source: ས་བཅུ་ཐོབ་པའི་བདག་པོ་ནི། །གང་ཡང་བྱང་ཆུབ་སེམས་དེ་ཡང་། །སེམས་ཅན་རྣམས་ནི་འདུལ་བྱེད་པ། །ཟླ་བ་ཞེས་ནི་རྣམ་པར་བསྒྲགས། །རིག་པའི་རྒྱལ་མོ་རྫུ་འཕྲུལ་ཆེ། །དེ་ནི་སྒྲོལ་མ་ཞེས་ཀྱང་བསྟན། །
en: “The bodhisattva known by the name Candra Is said to be Tāra , the savior. With this name, he is also Tārā, The vidyārājñī of great power and majesty. {53.814}

source: བུད་མེད་གཟུགས་འཆང་ལྷ་མོ་ནི། །འགྲོ་བ་ཀུན་ཏུ་རྣམ་པར་རྒྱུ། །སྙིང་རྗེས་བརླན་པའི་སེམས་ཀྱིས་ནི། །སེམས་ཅན་རྣམས་ལ་ཕན་དོན་དུ། །
en: “Having morphed into a goddess with a female form, He wanders throughout the entire world In order to benefit beings, With the mind tender with compassion. {53.815}

source: མི་མཇེད་འཇིག་རྟེན་ཁམས་གནས་ནས། །བུད་མེད་མིང་གིས་འཇུག་པར་བྱེད། །ས་བཅུ་ལ་ནི་རབ་གནས་ཐོབ། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེ། །
en: “In the world sphere of Sahā, He abides in the form called ‘woman,’ Who, nevertheless, is a powerful bodhisattva lord Abiding on the tenth level. {53.816}

source: སེམས་ཅན་རྣམས་ནི་འདུལ་བྱེད་པ། །ལྷ་མོ་སྒྲོལ་མ་ཞེས་སུ་བསྟན། །
en: “Famed as the goddess Tārā, He guides sentient beings

source: འདི་ནི་འབད་མེད་གྲུབ་པ་སྟེ། །སྲུང་དང་སྐྱོབ་དང་སྦེད་པར་བྱེད། །
en: And provides protection, shelter, and cover With his effortless magical power. {53.817}

source: ལོངས་སྤྱོད་དབང་ཕྱུག་འཕེལ་བྱེད་པས། །འདི་ནི་ལྷ་མོ་བསྒྲུབ་པར་བྱ། །བྱང་ཆུབ་ཚོགས་ཀྱི་ཆེད་དུ་ནི། །སྐྱེད་པ་ཉིད་ནས་བརྩམ་པར་བྱ། །
en: “One should strive to accomplish [the mantra Of] this goddess who brings opulence and power And constitutes the cause for accumulating [The merit and wisdom] necessary for awakening. {53.818}

source: སྙིང་རྗེས་བརླན་པས་ལུས་ཅན་ལ། །དེ་ཚེ་ལྷ་མོ་རྗེས་འབྲང་བ། །སྔགས་ཀྱི་གཟུགས་ཀྱིས་སེམས་ཅན་ལ། །བྱང་ཆུབ་ཚོགས་ནི་བྱ་ཕྱིར་རོ། །
en: “This goddess, at that time, will be connected, Through her compassion, to living beings, Constituting, in the form of the mantra, The cause for their accumulations that lead to awakening. {53.819}

source: རེ་བ་ཐམས་ཅད་དགའ་རྒྱས་ཕྱིར། །ཤར་གྱི་ཕྱོགས་སུ་གནས་པ་ཡིན། །
en: “She resides in the eastern region, Bringing happiness and nourishment to everyone.

source: བདག་ཉིད་རྣམ་པ་སྟོང་དང་ནི། །རྣམ་པ་མང་པོར་བྱས་ནས་ཀྱང་། །
en: She manifests in five hundred forms That [each] emanate many more. {53.820}

source: རྒྱ་མཚོ་བཞི་ཡི་མཐར་ཐུག་པར། །ས་རྣམས་ཀུན་ཏུ་རྣམ་པར་རྒྱུ། །
en: “She wanders the entire earth, As far as the four oceans.

source: དེ་ནས་ཤར་གྱི་ཕྱོགས་སུ་འམ། །ཡང་ན་བཱ་རཱ་ཎ་སཱིར་འགྲུབ། །
en: Her accomplishments will manifest Throughout the eastern region, in Vārāṇasī and beyond. {53.821}

source: ལྷ་མོ་དེ་ཡི་ཞིང་དུ་ནི། །ཤར་གྱི་ཕྱོགས་སུ་རབ་ཏུ་བསྟན། །
en: “The eastern region is famed As the territory of this goddess.

source: འོད་ཆེན་པོ་ནི་ཛམ་བྷ་ལ། །གནོད་སྦྱིན་རྒྱལ་པོ་ཡང་དག་འགྲུབ། །
en: There, too, can be accomplished Jambhala, A yakṣa king of great splendor. {53.822}

source: དེ་ཚེ་ལོངས་སྤྱོད་མ་ལུས་འདོད། །དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །ལྷ་མོ་སྒྲོལ་མ་གནོད་སྦྱིན་རྒྱལ། །དེ་ནོར་རྒྱས་པ་འདོད་པས་སྒྲུབ། །
en: “At that time during the debased eon, Those who desire affluence will be successful In accomplishing the yakṣa king and the goddess Tārā, Who fulfill the wishes for prosperity. {53.823}

source: དེ་ཚེ་ཁྲོ་བོའི་སྔགས་དག་ནི། །ལྷོ་ཕྱོགས་དག་ཏུ་བསྒྲུབ་པར་བྱ། །ཀླ་ཀློ་རྐུན་མའི་གླིང་དང་ནི། །དེ་བཞིན་རྒྱ་མཚོའི་ནང་དུ་ནི། །
en: “Similarly, the wrathful mantras Will be effective in the southern region, Including the islands in the middle of the ocean Inhabited by mlecchas and pirates. {53.824}

source: སྟོབས་ཆེན་སྒྲོལ་མ་གནོད་སྦྱིན་རྒྱལ། །དེ་བཞིན་དུ་ཡང་འགྲུབ་པར་འགྱུར། །ཧ་རི་ཀེལ་ཀ་ད་རཾ་ཙ། །ཀཱ་མ་རཱུ་པ་གཱ་དཱ་ཧཱ་ཡ་ཧི། ཕོ་ཉ་མོ་ཚོགས་རྣམ་མང་དང་། །གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་མོ་འགྲུབ། །
en: “Tārā and the powerful yakṣa king Will be accomplished also In Harikela, Karmaraṅga, Kāmarūpa, and Kalaśa. {53.825} “The mantras of all the various dūtīs And the powerful yakṣiṇīs,

source: འཇམ་པའི་དབྱངས་ཀྱིས་གང་གསུང་སྔགས། །ལོངས་སྤྱོད་ཀྱི་ནི་རྒྱུར་འགྱུར་བ། །དེ་བཞིན་ཡུལ་དེར་གྲུབ་པ་སྟེ། །གཞན་ཡུལ་དེ་བཞིན་མ་ཡིན་ནོ། །
en: And the wealth-bringing mantras Chanted by Mañjughoṣa, Will be effective in those places And no other. {53.826}

source: ཤར་ཕྱོགས་དང་ནི་ཕྱོགས་མཚམས་སུ། །རྣམ་པ་སྣ་ཚོགས་སྔགས་ཀྱི་རྒྱུར། །དེ་ཡི་དུས་སུ་བསྟན་པ་ནི། །ལུས་ཅན་རྣམས་ཀྱིས་བསྒྲུབ་པར་བྱ། །
en: “There, in the eastern and the intermediate directions, The mantras that serve different purposes Taught for that particular time Will be also accomplished by living beings. {53.827}

source: དབུས་ཀྱི་ཡུལ་དུ་དེ་བཞིན་སྔགས། །དེ་བཞིན་ས་སྲུང་མང་པོ་ནི། །རྒྱ་ཆེ་ཐམས་ཅད་ཉམ་ཆུང་བའི། །བློ་ཆུང་རྣམས་ཀྱིས་རྟོགས་པར་བྱེད། །
en: “In Madhyadeśa, there will be Various ministers and kings Who, generally, will be of weak character, Limited intelligence, and inferior understanding.

source: རྒྱལ་པོའི་གཙོ་བོ་མདོར་བསྡུས་ནས། །མིང་ནི་འདི་དག་ངེས་པར་བརྗོད། །
en: The most important of them Are briefly enumerated below. {53.828}

source: དང་པོའི་ཡི་གེ་ཤ་དང་ན། །དང་པོའི་ཡི་གེ་པར་ཡང་བསྟན། །དང་པོའི་ཡི་གེ་བ་དང་ཨེ། །དང་པོའི་ཡི་གེ་ཨར་ཡང་བསྟན། །དང་པོའི་ཡི་གེ་ཧར་བསྟན་ཏེ། །དང་པོའི་ཡི་གེ་པར་ཡང་བསྒྲགས། །དང་པོའི་ཡི་གེ་ཛ་དང་བ། །དང་ཡིག་དྷ་ནི་ཟླ་བའི་རིགས། །ཡི་གེ་ཧ་ཉིད་རྣམ་བསྒྲགས་དང་། །དེ་བཞིན་ཡང་ནི་དང་པོའི་ཨ། །དང་པོའི་ཡི་གེ་ས་ལ་ཡང་། །བུད་མེད་རིགས་མིན་འཇིག་རྟེན་སྡང་། །དང་པོའི་ཡི་གེ་ཨ་དང་མ། །འཇིག་རྟེན་རྣམས་ལ་མཐུ་དང་ལྡན། །
en: “Known by their initials, Their names begin With the letters M, N, P, D, I, S , and A. {53.829} “Further, there will be those With the names of Graha, and Kīrti And those with the initials H and Ś. {53.830} “There will be those from the lunar dynasty With the initials J, B , and L, And those with the initials H, Pra , and A. {53.831} “There will be those with female names Beginning with S and L , respectively, who will antagonize the people, And those with the initials S and M Will enjoy full sovereignty over the people. {53.832}

source: རིམ་གྱིས་རིམ་གྱིས་རིགས་དག་ནི། །བྲམ་ཟེ་རྗེའུ་རིགས་དག་ཏུ་འཇུག །
en: “Gradually, concerning their typical occupation, The brahmins will take on the lifestyle of the vaiśyas.

source: ཕལ་ཆེར་ཆོས་མིན་ལས་བྱེད་ཅིང་། །རྣམ་སྡང་བུད་མེད་ལ་བརྐམ་ཆགས། །
en: Most of them will commit acts contrary to the Dharma, Sowing discord and lusting after women. {53.833}

source: ས་སྲུང་སྐྱོན་ནི་རབ་མང་བར། །དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །
en: “At that time, in this debased eon, The kings will have huge retinues.

source: ཡུལ་གྱི་དབུས་སུ་མི་ཡི་བདག །འབྱུང་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །
en: This will no doubt be the case With the kings of Madhyadeśa. {53.834}

source: དུས་ཀྱི་ཐ་མར་འདི་དག་ཚེ། །ལོ་ནི་བརྒྱ་དང་ཉི་ཤུ་ཉིད། །དེ་ཡི་ཚེ་ན་མི་རྣམས་ཀྱི། །ཚེ་ནི་རིང་བར་རབ་ཏུ་བསྟན། །
en: “At that time, during this debased eon, A human lifespan Of one hundred and twenty years Will be extolled as long. {53.835}

source: དེ་དག་བར་མ་བཟང་པོ་ལས། །ཁྱད་པར་རིང་དང་ཐུང་བ་ཡིན། །
en: “Among the prominent people of Madhya[deśa], There will be those long- and short-[lived].

source: རྒྱལ་པོ་རྣམས་ནི་ཚེ་ཐུང་བར། །དེ་ཚེ་དུས་སུ་བསྟན་པ་ནི། །
en: All the kings foretold for this eon Will have a short lifespan. {53.836}

source: གང་གཱའི་འགྲམ་གྱི་ངོགས་དང་ནི། །གངས་ཅན་གྱི་ནི་རི་ཞོལ་དང་། །དེ་ཚེ་ཀཱ་མ་རཱུ་ཡུལ་དུ། །དེ་འདྲའི་རྒྱལ་པོ་འབྱུང་བར་འགྱུར། །
en: “On the banks of the Gaṅgā, In the valleys of the Himalayas, And also in the country of Kāmarūpa, There will be kings as listed below. {53.837}

source: དང་པོ་བར་མ་ཐ་མ་ཡི། །
en: “They are the first, the middle, and the last.

source: རིགས་ཀྱི་ལྷག་མ་བརྗོད་བྱ་སྟེ། །དང་པོའི་གཙོ་བོ་ཆེན་པོ་ནི། །རྣ་ཅན་རྒྱལ་པོར་རབ་ཏུ་བསྒྲགས། །
en: Those specified for the country of Aṅga Are as follows: the first one, Vṛtsudhāna, Will be known as Karmarāja, {53.838}

source: ཐ་མ་ཨང་གའི་བདག་པོ་དང་། །དེར་ནི་འབྱོར་བཟད་འབྱོར་པ་དང་། །ལེགས་བྱིན་སྲིད་པ་བྱིན་པ་ནི། །ཀཱ་མ་རཱུ་པའི་ཡུལ་དུ་བྱུང་། །
en: “And the last Aṅga king Will be Subhūtibhūti. In Kāmarūpa, there will be Sudaha and Bhavadatta, Who will be casteless. {53.839}

source: ཐ་མར་ལེགས་འབྱོར་གཞོན་ནུ་དང་། །ཡི་གེ་བ་དང་ཐ་གཉིས་ནི། །ཡངས་པ་ཅན་དུ་ཡང་དག་བྱུང་། །
en: “In Vaiśālī, at the time of V and Th, The last crown princes were Subhū and Mṛga.

source: གང་དུ་ཐུབ་པ་དེ་སྐྱེས་པ། །སེར་སྐྱ་ཞེས་བྱའི་གྲོང་མཆོག་ཏུ། །
en: In the fine city of Kapilavastu, Where the Sage was born, {53.840}

source: ཐ་མར་ཟས་གཙང་ཤཱག་རིགས་ཀྱི། །ཉི་མ་བུ་རམ་རིགས་སྐྱེས་པ། །
en: “The Śākya-born kings that ended with Śuddhodana Are said to descend from the solar Ikṣvāku dynasty.

source: ཐ་མར་ཟས་གཙང་རྣམ་བསྒྲགས་པ། །ཤཱཀྱ་ཤཱཀྱའི་རྣམ་འཕེལ་བྱེད། །
en: Śuddhodana is generally regarded as the last Śākya king Under whom the Śākyas prospered. {53.841}

source: སེམས་ཅན་བརྩོན་འགྲུས་ཆུང་བར་ནི། །འཇིག་རྟེན་སྐྱེས་མཆོག་བསྟན་པ་ཡིན། །
en: “The most eminent of men Also taught the mantras of the lesser capacity.

source: གང་ཞིག་རྒྱལ་བས་གསུང་སྔགས་དང་། །དེ་བཞིན་བྲན་པོའི་ཚོགས་ཀུན་དང་། །
en: These mantras, taught by the victors, Namely the mantras of all the ceṭa groups, {53.842}

source: ཕོ་ཉའི་ཚོགས་ཀུན་དུ་མ་དང་། །རྡོ་རྗེ་པདྨའི་རིགས་དག་ཀྱང་། །རྒྱུད་རྣམས་ཀུན་གྱི་དོན་རིག་པས། །བསྒྲུབས་ན་འགྲུབ་པར་འགྱུར་བ་ཡིན། །
en: “The various dūtī groups, And all such mantras that belong to the Vajra and Lotus families, Will all succeed when employed By the adepts of the mantra system. {53.843}

source: འཇིག་རྟེན་ཀུན་གྱི་སྔགས་དག་ནི། །ཡུལ་གྱི་དབུས་དེར་གྲུབ་པར་འགྱུར། །
en: “All these worldly mantras Will be effective in Madhyadeśa,

source: དབུས་ཡུལ་གནས་པར་ཁྱད་པར་དུ། །རྒྱལ་བས་གསུངས་པ་བསྒྲུབ་པར་བྱ། །
en: Particularly those that the victors Said reside in Madhyadeśa. {53.844}

source: རྣམ་པ་སྣ་ཚོགས་རྟགས་དང་ནི། །རྣམ་པ་སྣ་ཚོགས་རྒྱུད་དག་དང་། །
en: “With their different characteristics And different modes of function,

source: རྣམ་པ་སྣ་ཚོགས་སྦྱོར་བར་ལྡན། །ལུས་ཅན་རྣམ་པ་སྣ་ཚོགས་འགྲུབ། །
en: These mantras are employed in various manners, Bringing to beings various accomplishments. {53.845}

source: དབུས་ཀྱི་ཡུལ་དུ་དེ་བཞིན་སྔགས། །ལོངས་སྤྱོད་འཕེལ་བ་བསྒྲུབ་པར་བྱ། །
en: “Thus, the mantras particular to Madhyadeśa Are effective in bringing prosperity.

source: དེ་བཞིན་ལུས་ཅན་བསྲུང་དོན་དང་། །སྐྱོབ་དང་དབང་དང་དགུག་པ་འགྲུབ། །
en: They are also used for the sake of protection, Succor, and enthralling and attracting living beings. {53.846}

source: དབུས་ཀྱི་ཡུལ་དུ་མི་ཡི་བདག །འདས་དང་མ་འོངས་རབ་ཏུ་གསུངས། །
en: “The past and the future kings Of Madhyadeśa that have been listed

source: རྣམ་པ་སྣ་ཚོགས་རྟགས་དང་ནི། །རྣམ་པ་སྣ་ཚོགས་ཚེ་དང་རིགས། །
en: Are distinguished by their various characteristics, Such as different lifespan or family lineage. {53.847}

source: རྒྱལ་པོ་ཐམས་ཅད་གསུངས་པ་ནི། །མཆོག་དང་ཐ་མ་བར་མ་ཡིན། །
en: “All these kings are said to be Of either superior, middling, or inferior types.

source: དེ་བཞིན་རྣམ་གསུམ་གྲུབ་པ་སྟེ། །
en: The accomplishments, likewise, are of three types.

source: དུས་ཀྱང་གསུམ་དུ་སྦྱར་བར་བྱ། །དེ་བཞིན་སྔགས་ཀྱང་རྣམ་གསུམ་དུ། །དེ་བཞིན་ཐུབ་པ་མཆོག་གིས་གསུངས། །
en: The mantras that were taught by the most eminent of sages Are, accordingly, of three types And should be employed at three different times. {53.848}

source: རྒྱལ་པོ་མཐའ་ཡས་གསུངས་པ་ནི། །དབུས་ཀྱི་ཡུལ་དང་ནུབ་ཕྱོགས་དང་། །བྱང་ཕྱོགས་དང་ནི་ཤར་ཕྱོགས་དང་། །
en: “Innumerable kings have been specified For Madhyadeśa; the west, The north, the south, and the east;

source: དེ་བཞིན་ཕྱོགས་མཚམས་ཐམས་ཅད་དང་། །རྣམ་པ་བཞི་རུ་མཚོན་པ་ཡི། །གླིང་དག་དེ་བཞིན་ཀུན་ཏུ་ཡང་། །
en: For all the intermediated directions; And also for the outer islands, All divided into four groups. {53.849}

source: ས་བདག་མཐའ་ཡས་རབ་གསུངས་པ། །མཐའ་ཡས་སྔགས་ནི་སྒྲུབ་པ་དང་། །མཐའ་ཡས་ཡུལ་ལ་གནས་པ་དག །མཐའ་ཡས་སྔགས་ནི་ཡོངས་སུ་འགྲུབ། །
en: “The kings are said to be innumerable, And so are the mantra practices; The mantra accomplishments, ascribed To innumerable regions, are also innumerable. {53.850}

source: ཐུབ་པའི་བསྟན་པ་ནུབ་པ་ན། །ཚར་གཅད་རྗེས་སུ་གཟུང་བར་བྱེད། །དུས་སུ་རྒྱལ་པོ་དག་ལ་སྔགས། །འཇམ་དཔལ་གྱིས་ནི་གསུངས་པ་ཡིན། །
en: “When the teachings of the Sage have disappeared, For that particular time, Mañjughoṣa taught, with reference to kings, The mantras intended for suppressing or fostering. {53.851}

source: རྫུ་འཕྲུལ་རྩེ་དང་རྣམ་འཕྲུལ་དང་། །འདིར་ནི་དུས་ཀྱི་སྤྱོད་པའང་བསྟན། །
en: “Taught here are also time-specific performances For the sake of play, protection, or magic;

source: སྔགས་ཀྱི་བདག་ཉིད་སེམས་ཅན་གྱི། །འགྲོ་བ་སྐྱེ་གནས་རྒྱལ་པོའི་མིང་། །
en: The great [benefits of] the mantras; the types of birth of beings; And the names of the kings. {53.852}

source: སྔགས་ནི་སྒྲུབ་པར་འདོད་རྣམས་ལ། །ཡུལ་དང་དུས་ནི་ཡང་དག་བསྟན། །
en: “For those intending to do a formal mantra practice, There is a prescribed time and place.

source: བསྟན་པ་ནུབ་པའི་འོག་ཏུ་ནི། །ཞར་ལ་རྒྱལ་པོ་རྣམས་ཀྱིས་བསྟན། །ཡོན་ཏན་བདག་ཉིད་ཆེ་སྔགས་རྣམས། །ཐ་མར་འབྲས་བུ་རྟོགས་པར་བྱས། །
en: When the teachings of the path have disappeared, There are kings foretold who will, As required in these circumstances, teach about The greatness of mantra qualities and the final fruit. {53.853}

source: རྒྱལ་པོ་གཞན་ནི་ཐེག་པ་དང་། །སྔོན་ནི་འགལ་བ་མེད་པར་བསྟན། །དུས་ཀྱི་ཐ་མ་དེ་དུས་སུ། །རབ་ཏུ་གནས་པར་ཐེ་ཚོམ་མེད། །
en: “These kings, previously instructed In the two transcendent vehicles, Will establish themselves at that time, during the debased eon, As foretold, there is no doubt.

source: དེ་དག་ཕྱོགས་ལ་གནས་པར་ནི། །རྒྱལ་པོ་ཐམས་ཅད་གསུངས་པ་ཡིན། །
en: All of these kings are specified For their [respective] regions. {53.854}

source: དེ་བཞིན་ཤཱཀྱའི་གསུང་རབ་ལ། །ངེས་པར་རབ་བྱུང་གནས་ནས་ནི། །འཇིག་རྟེན་མིག་གཅིག་གྱུར་པ་ཡི། །ཐུབ་པ་མཆོག་ནི་མེད་པ་ན། །རྟག་ཏུ་སྔགས་སྨྲ་ལ་དད་པས། །བསྟན་པའི་དོན་ནི་བྱེད་པར་འགྱུར། །
en: “Having renounced the world and adhering firmly To the doctrine of Śākyamuni, They will serve the cause of the instructions And always delight in the mantra teachings. {53.855}

source: དེ་དག་གཞོན་ནུ་བཤད་པར་བྱ། །
en: “I will now speak, O divine youth, about those who will come After the best of sages—the one whose supreme vision Is uniquely focused on the world—has departed.

source: རྩེ་གཅིག་ཡིད་ཀྱིས་མཉན་པར་གྱིས། །
en: Please listen with undivided attention. {53.856}

source: སྟོན་པའི་གསུང་རབ་ས་སྟེང་དུ། །དུས་མཐར་འཇིག་རྟེན་ཉམས་པ་ན། །སྡོམ་བརྩོན་རྒྱལ་པོའི་ཚུལ་གྱིས་ནི། །འབྱུང་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །
en: “At the end of the eon, when the Teacher’s doctrine Has disappeared on earth and the world is corrupt, There will come, there is no doubt, Ascetics involved in affairs of state. {53.857}

source: དཔེར་ན་མ་ཁོལ་ཞེས་བྱ་དང་། །མེ་ཏོག་ཅེས་བྱར་རྣམ་པར་གྲགས། །ཡི་གེ་མ་ཞེས་གཞོན་ནུ་ཞེས། །དང་པོར་ཐ་མར་ཆོས་ལ་དགའ། །
en: “There will be one by the name Mātṛceṭa, One known as Kusuma, One with the initial M , and one with the initial Ku, Exceedingly fond of the Dharma; {53.858}

source: ཀླུས་བོས་ཞེས་བྱ་རྣམ་པར་གྲགས། །རིན་ཆེན་འབྱུང་ཞེས་བྱ་མིང་དང་། །ཡི་གེ་ག་ཞེས་གཞོན་ནུ་ཞེས། །ཡི་གེ་བ་ཞེས་ཆོས་སེམས་བྱེད། །
en: “Also, one referred to as Nāga With the name of Ratnasambhava, One with the initial G , one called Kumāra, And one with the initial V who will care for the Dharma;

source: ཡི་གེ་ཨ་མིང་བདག་ཉིད་ཆེ། །སྟོན་པའི་བསྟན་པ་གཅེས་འཛིན་བྱེད། །
en: {53.859} “Also, a powerful person with the initial A — An irresistible defender of the Teacher’s teachings—

source: བློ་ལྡན་ཡོན་ཏན་ཀུན་གྱིས་བཀུར། །དང་པོའི་ཡི་གེ་ལ་ཞེས་བསྟན། །
en: And one known by his initial L, Endowed with virtue and intelligence; {53.860}

source: རྒྱལ་པོ་སངས་རྒྱས་པ་ཡི་ཕྱོགས། །སྟོན་པའི་བསྟན་པ་གསལ་བར་བྱེད། །
en: And King Buddhapakṣa, during whose reign The doctrine of the Teacher will shine brightly. {53.861}

source: སྡོམ་བརྩོན་ཡི་གེ་ཨ་ཞེས་བསྒྲགས། །བྲམ་ཟེ་ལས་ནི་རབ་ཏུ་བྱུང་། །གྲོང་ཁྱེར་གནས་བཅས་གནས་པ་སྟེ། །དེ་བཞིན་ཚེ་ནི་བརྒྱད་ཅུར་འཚོ། །
en: “There will be a brahmin ascetic with the initial A Who becomes a Buddhist monk— A citizen of the city of Sāketa Who will live eighty years. {53.862}

source: དང་ཡིག་ཡི་གེ་ཨ་དགེ་སློང་། །ལྷོ་ཡི་ཕྱོགས་སུ་འབྱུང་བར་འགྱུར། །བློ་ལྡན་ཚེ་ནི་དྲུག་ཅུར་འཚོ། །ཀ་ཤི་ཞེས་བྱའི་གྲོང་དུ་གནས། །
en: “In the southern region there will be An ascetic with an initial A Who is a citizen of Kāśī, is intelligent, And will live sixty years. {53.863}

source: ཡི་གེ་དྷ་ཞེས་སྡོམ་བརྩོན་ཉིད། །ལྷོ་ཡི་ཕྱོགས་སུ་རྣམ་པར་བསྒྲགས། །
en: “Also in the southern region there will be A well-known ascetic with the initial Th.

source: ཕ་རོལ་རྒོལ་བ་བཟློག་ནས་ཀྱང་། །དེ་བཞིན་སྡོམ་བརྩོན་སྔགས་ཀྱང་གྲུབ། །
en: This ascetic, accomplished in mantra, Will suppress the doctrines of other systems. {53.864}

source: གཞན་ཡང་རབ་བྱུང་དམ་པ་ནི། །སིང་ག་ལ་ཡི་གྲོང་ན་གནས། །
en: “Another eminent renunciant Will be a citizen of the city of lions.

source: འཕགས་པ་མིན་ལ་འཕགས་པའི་མིང་། །སིང་ག་ལ་ཡི་གླིང་ན་གནས། །
en: This inhabitant of the island of Siṃhala Will be able to tell the ignoble from the noble, {53.865}

source: ཕ་རོལ་རྒོལ་བ་བཟློག་ནས་ནི། །མུ་སྟེགས་རྣམས་ཀྱི་སྔགས་སུན་ཕྱུང་། །
en: “And he will refute the tenets of the tīrthikas And suppress the doctrines of others.

source: དེ་དུས་འཇིགས་སུ་རུང་བ་ཡི། །དུས་ཀྱི་མཐའ་ལས་འབྱུང་བར་འགྱུར། །
en: These people will come at that terrible time At the end of the eon. {53.866}

source: ཡི་གེ་ད་དང་ལ་དང་པོར། །སྡོམ་བརྩོན་གང་ཞིག་རབ་གསུངས་དང་། །ཡི་གེ་ར་དང་བ་དང་པོར། །དགེ་སློང་གང་ཞིག་རབ་བྱུང་གསུངས། །
en: “There will be one ascetic with the V initial, One with the L initial, One with the R initial, And also a renunciate monk with the V initial, {53.867}

source: སྟོན་པའི་བསྟན་པ་གསལ་བྱེད་པ། །འབྱུང་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །
en: “Who will be, without a doubt, Wholly devoted to the Teacher’s teachings.

source: རྒྱལ་པོ་ནག་པོ་ཞེས་བྱ་བར། །ཡི་གེ་ས་ཞེས་སྡོམ་བརྩོན་འབྱུང་། །
en: During [the reign of] a king called Bālāka, There will be an ascetic with the initial S. {53.868}

source: མཆོད་རྟེན་ཀུན་དགའ་ར་བ་གནས། །རྫིང་དང་ཁྲོན་པའང་ཐམས་ཅད་དུ། །
en: “He will build monasteries, ashrams, caityas, Ponds, and wells everywhere.

source: སྟོན་པའི་གཟུགས་བརྙན་དེ་བཞིན་རྟགས། །གཟིངས་དང་ཟམ་པ་ཉིད་རྣམས་ནི། །བྱེད་པར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །མཚོན་གྱིས་ལུས་ཞིག་མཐོ་རིས་འགྲོ། །
en: He will make banners and images of the Teacher And construct bridges and ferry crossings. {53.869} “He will be remembered, there is no doubt, as the one Who was slain with a weapon and ascended to the higher realms.

source: དེ་ནས་ཡི་གེ་ས་དང་ཀ། །དང་པོ་དག་ཏུ་བརྗོད་པ་དང་། །དེ་བཞིན་ཡི་གེ་ར་དང་གྷ། །དང་པོ་དག་ཏུ་རབ་བརྗོད་དང་། །དང་པོར་ཡི་གེ་བ་དང་ནི། །ལེགས་བྱིན་ལེགས་དེ་སྡེ་ཞེས་བསྟན། །སྦྱིན་བྱེད་སྦྱིན་པར་བྱེད་པ་ཉིད། །གཞན་གྱི་གྲུབ་མཐའ་སུན་བྱེད་པ། །
en: After him there will be one with the initial M, One known by the name beginning with K, {53.870} “One with the initial N, Sudatta, Suṣeṇa known as Sena, Dattaka, and Dinaka who will refute The doctrines of other systems, {53.871}

source: ཚོང་པ་སྔོན་དང་སྨན་པ་སྔོན། །གཉི་ག་སྦྱིན་བྱེད་སྣ་ཚོགས་བྱེད། །
en: “And also a former merchant and a former physician, Both concerned about the welfare of the poor.

source: ཡི་གེ་བ་ཞེས་སྡོམ་བརྩོན་བསྒྲགས། །དེ་ལས་གཞན་པ་དང་ཡི་གེར། །
en: There will also be an ascetic known by the initial C, And after him one with the initial R. {53.872}

source: དང་པོར་ཡི་གེ་བ་གྲགས་དང་། །སྟོན་པའི་གཟུགས་བརྙན་དོན་ཡང་བྱེད། །
en: “A Bh -initialed ascetic, one with deep faith, Will be instrumental in producing images of the Teacher.

source: བློ་ལྡན་དང་པོར་ཡི་གེ་མ། །དེ་བཞིན་སྡོམ་བརྩོན་དད་པ་འབྱུང་། །
en: Another ascetic, with the initial M , will also be born, Who is intelligent and has faith. {53.873}

source: རྣམ་པ་དུ་མ་སྡོམ་བརྩོན་གསུངས། །དེ་ཚེ་མཐའ་ཡས་འབྱུང་བར་འགྱུར། །
en: “Various ascetics [such as those] mentioned And innumerable [others] will come at that time.

source: སྡོམ་བརྩོན་ཐམས་ཅད་བསྒྲགས་པ་ཡང་། །སྟོན་པའི་བསྟན་པ་གསལ་བྱེད་པའོ། །
en: All of them will be known As torchbearers of the Teacher’s instructions. {53.874}

source: བསྟན་པ་དེ་ཚེ་ས་སྟེང་དུ། །རྣམ་པར་ཉམས་ཤིང་སྣང་མེད་ལ། །སྟོན་པའི་གཟུགས་བརྙན་ཡིད་དུ་འོང་། །བྱེད་པར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །
en: “When the instructions have disappeared And the earth is deprived of their light, These ascetics will make, without a doubt, Beautiful images of the Teacher. {53.875}

source: ཐམས་ཅད་བྱང་ཆུབ་ལུང་བསྟན་ཏེ། །ང་ཡི་བྱང་ཆུབ་མཆོག་ཐོབ་འགྱུར། །
en: “All of them have been prophesied to attain awakening And will certainly become models of attainment.

source: དེ་བཞིན་འཇིག་རྟེན་སྦྱིན་གནས་འགྱུར། །སྲིད་པ་གསུམ་གྱི་མཐར་ཡང་བྱེད། །སྔགས་དང་རྒྱུད་ལ་མངོན་བརྩོན་པས། །གྲགས་པ་འཛིན་པར་ཤེས་པར་བྱ། །
en: Accordingly, they will be venerated in the world As the terminators of the three states of existence Known for their direct application of mantra methods And for making [others] worthy of praise. {53.876}

source: བྲམ་ཟེ་ཆོས་ཀྱི་ངང་ཚུལ་ཅན། །དེ་ནི་རབ་ཏུ་བརྗོད་པར་བྱ། །སྔགས་དང་རྒྱུད་ལ་མངོན་བརྩོན་པས། །རྒྱལ་པོའི་ལུགས་ལ་ཉེ་བར་གནས། །
en: “Now I will tell about the brahmins, Disciplined in the Dharma, Who will be involved in affairs of state By directly applying the mantra methods.

source: དེ་ཚེ་མི་བཟད་དུས་དག་ཏུ། །འཇིག་རྟེན་ཀུན་ལ་འབྱུང་བར་འགྱུར། །
en: During that terrible time They will exist all over the world. {53.877}

source: ཡི་གེ་བ་ཞེས་བྲམ་ཟེ་མཆོག །ཕྱུག་ཅིང་རིག་བྱེད་ཕ་རོལ་ཕྱིན། །
en: “There will be an eminent brahmin with the initial V, Wealthy and fully conversant in the Vedas,

source: དེ་འདིར་ས་རྣམས་མ་ལུས་པར། །རྩོད་པའི་ཕྱིར་ནི་རབ་ཏུ་རྒྱུ། །
en: Who will wander the earth to its farthest limits In order to debate others. {53.878}

source: མཚོ་གསུམ་ས་ཡི་མཐར་ཐུག་པར། །ཕ་རོལ་མུ་སྟེགས་རྩོད་ལ་དགའ། །
en: “He will delight in controverting other schools As far away as the lands beyond the three oceans.

source: གང་ཕྱིར་དང་པོ་གཙོ་བོའི་ཚིག །སེམས་ཅན་རྣམས་ལ་ཕན་འདོད་པས། །གཞོན་ནུས་ཡོངས་སུ་གསུངས་གྱུར་པ། །ཡི་གེ་དྲུག་པའི་སྔགས་ཀྱང་ཟློས། །
en: When facing others in debate, He will recite the six-syllable mantra, {53.879} “Which the divine youth conveyed in song Out of his desire to benefit beings.

source: ཆོ་ག་རབ་འབྱམ་འདི་དག་ལས། །དེས་ནི་དེ་ཕན་དེ་ལ་བསྟེན། །
en: This famous [mantra] from his extensive manual Is for [helping those] of slow intellect. {53.880}

source: རྒྱལ་དང་ལེགས་པར་རྒྱལ་བ་དང་། །གྲགས་ལྡན་དགེ་བ་དེ་ལས་གཞན། །རིགས་ལྡན་ཆོས་དང་ལྡན་པ་དང་། །བརྩོན་ལྡན་ལེགས་པ་ཁྱབ་འཇུག་དང་། །སྦྲང་རྩི་སྦྲང་རྩི་བཟང་པོ་དང་། །དེ་བཞིན་གྲུབ་དང་དྲེགས་བྲལ་དང་། །
en: “There will be Jaya and Sujaya, And after them, the celebrated Śubhamata, Well-born and virtuous, And the good and hard-working Mādhava. {53.881} “Further, there will be, at that time, Madhu, Sumadhu, Siddha , and Nama.

source: ར་གྷ་བ་དང་དམངས་རིགས་དང་། །དེ་བཞིན་ཀ་ཤིར་སྐྱེས་པ་གཞན། །
en: There will be Rāghava of the śūdra caste, And others, of Scythian ancestry. {53.882}

source: གཞོན་ནུ་འདི་ཡི་བཟླས་པ་ལ། །ཐམས་ཅད་ཀུན་ཡང་འབྱུང་བར་འགྱུར། །
en: “While debating, all of them will recite The mantra of the divine youth present here.

source: དེ་དག་ཀུན་ཀྱང་བཟང་པོ་སྟེ། །བློ་ལྡན་མང་དུ་ཐོས་པ་ཡིན། །
en: All of them will be honest, Intelligent, and learned.

source: དེ་ཀུན་སྔགས་ནི་མངོན་དུ་གྱུར། །རྒྱལ་པོའི་འཚོ་བས་ཡང་དག་གནས། །
en: They will be involved in affairs of state Alongside the ministers. {53.883}

source: དེ་འོག་རྣམ་པར་གྲགས་པ་ནི། །བྲམ་ཟེ་དང་པོའི་ཡི་གེ་བི། །གྲོང་ཁྱེར་མེ་ཏོག་ཅེས་བྱ་བར། །
en: “Another brahmin, known by the name Beginning with Vi, Will live in the Flower City.

source: དེ་ནི་ཁྲོ་བོ་གྲུབ་པར་གྱུར། །
en: He will accomplish [the mantra of] Krodha.

source: དབུལ་བས་ཡོངས་སུ་ཟིལ་མནན་པས། །རྒྱལ་པོ་རྣམས་ནི་ཚར་བཅད་བྱས། །
en: Having experienced poverty and humiliation, He will direct his acts of destruction at kings. {53.884}

source: ཁྲོ་རྒྱལ་གཤིན་རྗེ་གཤེད་དེ་ཡི། །འཇམ་པའི་དབྱངས་ཀྱིས་འདིར་གསུངས་པ། །སེམས་ཅན་མ་རུངས་རྣམས་དང་ནི། །གདུལ་དཀའ་འདུལ་བར་བྱེད་པ་དང་། །
en: “Taught by Mañjughoṣa present here, This [mantra of] Yamāntaka, the Lord of Wrath, Is the tamer of the wicked beings So difficult to tame. {53.885}

source: ཕན་པ་མིན་ལས་བཟློག་དོན་དང་། །ཕན་པ་ཉེ་བར་འཕེལ་ཕྱིར་དང་། །
en: “It is for suppressing what is bad And promoting what is good.

source: སེམས་ཅན་རྣམས་ནི་རྗེས་གཟུང་དང་། །སེམས་ཅན་སྲོག་འཆད་དགག་ཕྱིར་རོ། །
en: It can also be used to destroy physical life, But only as an act of kindness to sentient beings. {53.886}
